Repository: echopan/XAMPP_Control_Panel_Chinese
Catalog: locale/*/LC_MESSAGES/xampp_control.po
Languages: de

source: Configuration of Control Panel
de: 程序设置

source: Editor:
de: 编辑器 :

source: Browser (empty = system default)
de: 浏览器 (空白 = 系统默认):

source: Save
de: 保存

source: Abort
de: 取消

source: Show debug information
de: 显示调试信息

source: Details
de: 具体

source: More Details
de: 更多细节

source: Autostart of modules
de: 模块自启

source: Selected modules will be started on next launch of the Control Panel.
de: 选中的模块将在下次打开软件时自动启用.

source: Check default ports on startup
de: 启动时检查默认端口

source: Change Language
de: 切换语言

source: User Defined Files
de: 用户自定义文件

source: Enable Tomcat output window
de: 打开 Tomcat 输出窗口

source: Log Options
de: 日志选项

source: Service and Port Settings
de: 服务与端口设置

source: Start Control Panel Minimized
de: 启动时最小化窗口

source: Executables (*.exe)|*.exe|All files (*.*)|*.*
de: 可执行文件 (*.exe)|*.exe|所有文件 (*.*)|*.*

source: User-defined log/config-files
de: 用户自定义日志/配置文件

source: Enter user defined files. Files must be relative to xampp-basedir!
de: 请输入自定义文件路径. 该文件必须位于 xampp-basedir 目录及其子目录下!

source: Example: "apache\conf\extra\httpd-info.conf"
de: 举例: "apache\conf\extra\httpd-info.conf"

source: Config
de: 配置

source: Logs
de: 日志

source: Help
de: 帮助

source: Programmed by Steffen Strueber
de: 由 Steffen Struber 编写

source: Enhanced by hackattack142
de: 由 hackattack142 改进

source: Need Help? Visit the XAMPP forums (English):
de: 需要帮助? 访问 XAMPP 论坛 (英文) :

source: Need Help? Visit the XAMPP forums (German):
de: 需要帮助? 访问 XAMPP 论坛 (德语) :

source: Close
de: 关闭

source: View ReadMe
de: 软件说明

source: Language
de: 语言

source: Log Font
de: 日志字体

source: Log Font Size
de: 日志字体大小

source: Select Font
de: 选择字体

source: XAMPP Control Panel v
de: XAMPP 控制面板 v

source: Services
de: 系统服务

source: Modules
de: 模块

source: Service
de: 服务

source: Module
de: 模块

source: Actions
de: 操作

source: Start
de: 开启

source: Admin
de: 管理

source: Is installed as a Windows Service?
de: 是否作为 Windows 服务 安装?

source: Quit
de: 退出

source: Explorer
de: 软件目录

source: Netstat
de: 网络信息

source: Shell
de: 终端

source: Show / Hide
de: 显示 / 隐藏

source: Copy
de: 复制

source: Select All
de: 选择全部

source: Netstat - TCP Listening sockets
de: 网络信息 - TCP 连接状态

source: Address
de: 地址

source: Port
de: 端口

source: Name
de: 名称

source: Refresh
de: 刷新

source: Active socket
de: 正在运行

source: Old socket
de: 连接关闭

source: New socket
de: 新的连接

source: Service Settings
de: 服务设置

source: Use this form to set service-specific and default port settings. You can set the name and default ports the XAMPP Control Panel will check. Do not include spaces or quotes in names. This does NOT change the ports that the services and programs use. You still need to change those in the services' configuration files.
de: 在当前界面配置服务名称及其默认端口. XAMPP 将尝试对配置的服务名称及其端口进行检查, 输入时请不要包含空格或引号. 上述配置不会同步至系统服务和相关程序, 您还需要在服务对应的配置文件中进行更改.

source: Apache Settings
de: Apache 设置

source: Service Name
de: 服务名称

source: Main Port
de: 默认端口

source: SSL Port
de: SSL 端口

source: MySQL Settings
de: MySQL 设置

source: FileZilla Settings
de: FileZilla 设置

source: Admin Port
de: 管理员端口

source: Mercury Settings
de: Mercury 设置

source: Port 1
de: 端口 1

source: Port 2
de: 端口 2

source: Port 3
de: 端口 3

source: Port 4
de: 端口 4

source: Port 5
de: 端口 5

source: Port 6
de: 端口 6

source: Port 7
de: 端口 7

source: Tomcat Settings
de: Tomcat 设置

source: HTTP Port
de: HTTP 端口

source: AJP Port
de: AJP 端口

source: Executing "%s" "%s"
de: 正在执行 "%s" "%s"

source: Executing "%s"
de: 正在执行 "%s"

source: Service installed
de: 服务已安装

source: Service not installed
de: 服务未安装

source: Checking for service (name="%s"): %s
de: 正在检查服务 (名称 = "%s"): %s

source: Service Path: %s
de: 服务路径: %s

source: %s Service detected with wrong path
de: 检测到 %s 服务路径错误

source: Change XAMPP %s and Control Panel settings or
de: 更改 XAMPP %s 和程序设置 或者

source: Uninstall/disable the other service manually first
de: 请先手动卸载/禁用其他服务

source: Found Path: %s
de: 找到的路径: %s

source: Expected Path: "%sapache\bin\%s" -k runservice
de: 要求的路径: "%sapache\bin\%s" -k runservice

source: Service Path: Service Not Installed
de: 服务路径 : 服务未安装

source: Initializing module...
de: 正在初始化模块...

source: Checking for module existence...
de: 正在检查模块是否存在...

source: Problem detected: %s Not Found!
de: 检测到问题: %s 未找到!

source: Disabling %s buttons
de: 正在禁用对 %s 的操作

source: Run this program from your XAMPP root directory!
de: 请从 XAMPP 根目录运行此程序!

source: %s Service is disabled.
de: %s 服务被禁用.

source: Checking for required tools...
de: 正在检查需要的工具...

source: Checking default ports...
de: 正在检查默认端口...

source: Portblocker Detected: %s
de: 检测到端口被屏蔽 : %s

source: Checking for App: %s
de: 正在检查应用 : %s

source: Checking for Service: %s
de: 正在检查服务 : %s

source: Portblocker Path: %s
de: 端口防火墙路径 : %s

source: Portblocker Service Path: %s
de: 端口防火墙服务路径 : %s

source: XAMPP %s is already running on port %d
de: XAMPP %s 已经在端口 %d 上运行

source: XAMPP %s Service is already running on port %d
de: XAMPP %s 服务已经在端口 %d 上运行

source: Problem detected!
de: 检测到问题!

source: Port %d in use by "%s" with PID %d!
de: 端口 %d 正在被 "%s" ( PID %d ) 使用!

source: %s WILL NOT start without the configured ports free!
de: 在配置的端口空闲之前, %s 将不会启动!

source: You need to uninstall/disable/reconfigure the blocking application
de: 您需要 卸载/禁用/重新配置 正在占用该端口的应用

source: or reconfigure %s and the Control Panel to listen on a different port
de: 或者配置 %s 和控制面板使用其它可用端口

source: Installing service...
de: 正在安装服务...

source: Executing "%s %s"
de: 正在执行 "%s %s"

source: Return code: %d
de: 返回代码: %d

source: There may be an error, return code: %d - %s
de: 可能存在错误，返回代码 : %d - %s

source: Uninstalling service...
de: 正在卸载服务...

source: Attempting to start %s service...
de: 正在尝试启动 %s 服务...

source: Attempting to start %s app...
de: 正在尝试启动 %s 应用...

source: Attempting to stop %s service...
de: 正在尝试停止 %s 服务...

source: Attempting to stop
de: 正在尝试停止

source: Problem killing PID %d
de: 结束 PID %d 时出现问题

source: Check that you have the proper privileges
de: 请检查您是否具有适当的权限

source: No PIDs found?!
de: 未发现 PID?!

source: running
de: 运行中

source: stopped
de: 已停止

source: Status change detected:
de: 检测到状态变化:

source: Error: %s shutdown unexpectedly.
de: 错误: %s 意外停止.

source: This may be due to a blocked port, missing dependencies,
de: 这可能是由于端口受阻、缺少依赖项、

source: improper privileges, a crash, or a shutdown by another method.
de: 权限不足、程序崩溃, 或以其他方式关闭了服务.

source: Press the Logs button to view error logs and check
de: 请通过操作中的日志选项查看报错原因

source: the Windows Event Viewer for more clues
de: 打开 Windows 事件查看器 获取更多线索

source: If you need more help, copy and post this
de: 如果您需要更多帮助, 请复制全部日志内容

source: entire log window on the forums
de: 到我们的论坛上发帖求助

source: Stop
de: 停止

source: Autostart aborted: %s is already running
de: 自启动未执行 : %s 已经处在运行中了

source: Autostart active: starting...
de: 自启动已激活 : 执行中...

source: Expected Path: "%sFileZillaFTP\%s"
de: 要求的路径: "%sFileZillaFTP\%s"

source: Checking for alternate module existence...
de: 正在检查备用模块是否存在...

source: Port %d in use by "%s"!
de: 端口 %d 正在被 "%s" 使用!

source: Setting Service Name...
de: 正在设置服务名称...

source: Setting Service Display Name...
de: 正在设置服务展示名称...

source: Attempting to stop %s app...
de: 正在尝试停止 %s 应用...

source: Restart application to apply changes!
de: 请重启应用以使更改生效!

source: Services cannot be installed or uninstalled while the service is running!
de: 服务正在运行, 无法安装或卸载!

source: Click Yes to uninstall the %s service
de: 选择 Yes 卸载 %s 服务

source: Click Yes to install the %s service
de: 选择 Yes 安装 %s 服务

source: Service was NOT (un)installed!
de: 服务未能安装 (卸载)!

source: One possible reason for failure: On windows security box you !!!MUST UNCHECK!!! the "Protect my computer and data from unauthorized program activity" checkbox!!!
de: 失败的可能原因: 在Windows的安全设置中, 您必须取消选择"保护我的计算机和数据不受未经授权的程序活动的影响"的选项!

source: Successful!
de: 成功!

source: <Browse>
de: <浏览>

source: Mercury cannot be run as service!
de: Mercury 无法作为服务启动!

source: File "%s" not found. Should it be created now?
de: 未找到 "%s" 目录, 是否现在创建该目录?

source: Error
de: 错误

source: User defined
de: 用户自定义

source: Executing %s %s
de: 正在执行 %s %s

source: Initializing Control Panel
de: 正在初始化控制面板

source: Windows Version: %s %s %s
de: Windows 版本: %s %s %s

source: WARNING: Your Operating System is too old and is not supported
de: 警告: 您的操作系统版本过低, 不支持该操作

source: Running with Administrator rights - good!
de: 正在以管理员身份运行 - 好耶!

source: You are not running with administrator rights! This will work for
de: 您未以管理员身份运行! 这对大部分功能没有影响,

source: most application stuff but whenever you do something with services
de: 但是当您要对服务进行安装或卸载等操作时,

source: there will be a security dialogue or things will break! So think
de: 可能会弹出安全警告或者操作失败!

source: about running this application with administrator rights!
de: 因此, 建议您以管理员身份运行本软件!

source: XAMPP Installation Directory: "%s"
de: XAMPP 安装目录 : "%s"

source: WARNING: Your install directory contains spaces. This may break programs/scripts
de: 警告: 您的安装目录包含空格. 这可能会损坏程序/脚本

source: WARNING: Your install directory contains special characters. This may break programs/scripts
de: 警告: 您的安装目录包含特殊字符. 这可能会损坏程序/脚本

source: Checking for prerequisites
de: 正在检查运行要求

source: Required XAMPP prerequisite not found!
de: 未找到运行 XAMPP 所必须的依赖!

source: You do not appear to have the Microsoft Visual C++ 2008 Runtimes installed
de: 您似乎没有安装 Microsoft Visual C++ 2008 运行库

source: This is required for XAMPP to fully function
de: 安装后您才能正常使用 XAMPP 的全部功能

source: All prerequisites found
de: 运行所需的依赖全部满足

source: VC++ checking is disabled
de: VC++ 检查 已禁用

source: Initializing Modules
de: 正在初始化模块

source: The %s module is disabled
de: 模块 %s 被禁用

source: Enabling autostart for module "%s"
de: 允许模块 "%s" 自启动

source: Starting
de: 正在启动

source: Control Panel Ready
de: 控制面板 准备就绪

source: Deinitializing Modules
de: 正在释放 模块 资源

source: Deinitializing Control Panel
de: 正在释放 控制面板 资源

source: Expected Path: %smysql\bin\%s --defaults-file=%smysql\bin\my.ini %s
de: 要求的路径: %smysql\bin\%s --defaults-file=%smysql\bin\my.ini %s

source: New listening socket: %s:%d
de: 新的监听接口: %s:%d

source: Listening socket closed: %s:%d
de: 接口已关闭 : %s:%d

source: unknown program
de: 未知程序

source: Deleting PID-entry %d: %s
de: 正在删除 PID条目 %d: %s

source: Creating PID-entry %d: %s
de: 正在新建 PID条目 %d: %s

source: Searching for service %s
de: 正在查找服务 %s

source: Found service, attempting to start
de: 服务已找到, 正在尝试启动

source: Return Code %d
de: 返回代码 %d

source: Found service, attempting to stop
de: 服务已找到, 正在尝试停止

source: Expected Path: %stomcat\bin\%s //RS//%s
de: 要求的路径: %stomcat\bin\%s //RS//%s

source: Problem detected: Required Tool catalina_start.bat Not Found!
de: 检测到问题 : 找不到所需的 catalina_start.bat!

source: Problem detected: Required Tool catalina_stop.bat Not Found!
de: 检测到问题 : 找不到所需的 catalina_stop.bat!

source: Problem detected: Required Tool catalina_service.bat Not Found!
de: 检测到问题 : 找不到所需的 catalina_service.bat!

source: Java is already running on port %d!
de: Java 已运行在端口 %d 上!

source: Is %s already running?
de: %s 是否已在运行?

source: %s Service Install stopped with errors, return code: %d
de: %s 服务安装时出错, 返回代码 : %d

source: Make sure you have Java JDK or JRE installed and the required ports are free
de: 确保您已经安装了 JDK 或者 JRE, 并且请求的端口未被占用

source: Check the "/xampp/tomcat/logs" folder for more information
de: 检查 "/xampp/tomcat/logs" 文件夹以获取更多信息

source: %s Service Uninstall stopped with errors, return code: %d
de: %s 服务卸载时出错， 返回代码 : %d

source: %s Started/Stopped with errors, return code: %d
de: %s 开启/停止时出错， 返回代码 : %d

source: Attempting to stop %s
de: 正在尝试停止 %s
